{
    "momsurewen-7b14": "## Translation\n\"Sure. We need three tomatoes, four eggs, five apples, and bread.\"\n\n## Sentence Breakdown\n\n- **أكيد** (Akeed): This word means \"sure\" or \"certainly.\" It is used to express agreement or confirmation.\n- **نحتاج** (Naḥtāj): This means \"we need.\" It is the present tense form of the verb \"to need\" in the first-person plural.\n- **لثلاث حبات من الطماطم** (Li-thalāth ḥabāt min aṭ-ṭamāṭim):\n  - **لثلاث** (Li-thalāth): \"Three\"\n  - **حبات** (Ḥabāt): \"pieces\" or \"units\"\n  - **من** (Min): \"of\"\n  - **الطماطم** (Aṭ-ṭamāṭim): \"tomatoes\"\n- **أربع بيضات** (Arbaʿ bayḍāt):\n  - **أربع** (Arbaʿ): \"Four\"\n  - **بيضات** (Bayḍāt): \"eggs\"\n- **خمس حبات من التفاح** (Khams ḥabāt min at-tuffāḥ):\n  - **خمس** (Khams): \"Five\"\n  - **حبات** (Ḥabāt): \"pieces\" or \"units\"\n  - **من** (Min): \"of\"\n  - **التفاح** (At-tuffāḥ): \"apples\"\n- **والخبز** (Wa-l-khubz):\n  - **و** (Wa): \"and\"\n  - **الخبز** (Al-khubz): \"bread\"\n\n## Grammar\n\n- **أكيد** (Akeed) is an adverb used to confirm or agree with a statement.\n- **نحتاج** (Naḥtāj) is a verb in the present tense, first-person plural form, meaning \"we need.\"\n- The construction **لثلاث حبات من الطماطم** uses the preposition **من** (min) to indicate \"of,\" specifying the quantity and type of item needed.\n- The numbers **ثلاث** (thalāth), **أربع** (arbaʿ), and **خمس** (khams) are followed by the nouns they quantify, which is a standard structure in Arabic.\n- The word **حبات** (ḥabāt) is used to specify units or pieces of fruits and vegetables.\n- The conjunction **و** (wa) means \"and\" and is used to connect the last item in the list.\n\n## Translation Notes\n\n- The Arabic sentence structure closely mirrors the English sentence, making it straightforward to translate.\n- The use of **حبات** (ḥabāt) to specify units of fruits and vegetables is a common practice in Arabic, which might not have a direct equivalent in English but helps in specifying the quantity clearly.\n- The preposition **من** (min) is used to indicate \"of,\" which is similar to the English \"of\" but is more frequently used in Arabic to specify quantities.\n- The conjunction **و** (wa) is used similarly to the English \"and\" to connect items in a list.",
    "peteridlik-7570": "## Translation\n\"I'd like to get some chocolate or maybe a pastry.\"\n\"أريد الحصول على بعض الشوكولاتة أو ربما بعض من الكعك.\"\n\n## Sentence Breakdown\n\n- **أريد (urīdu)**: This means \"I want\" or \"I would like.\" It is a common way to express a desire or preference.\n- **الحصول على (al-ḥuṣūl ‘alā)**: This phrase means \"to get\" or \"to obtain.\" It is used to indicate the action of acquiring something.\n  - **الحصول (al-ḥuṣūl)**: \"Obtaining\" or \"getting.\"\n  - **على (‘alā)**: \"On\" or \"to,\" used here to indicate the object being obtained.\n- **بعض (ba‘ḍ)**: This means \"some.\" It is used to indicate a quantity that is not specific.\n- **الشوكولاتة (al-šukulātah)**: This means \"chocolate.\"\n- **أو (aw)**: This means \"or.\" It is used to present an alternative.\n- **ربما (rubbamā)**: This means \"maybe.\" It expresses uncertainty or possibility.\n- **بعض من (ba‘ḍ min)**: This means \"some of.\" It is used to indicate a part of a whole.\n- **الكعك (al-ka‘k)**: This means \"pastry\" or \"cake.\"\n\n## Grammar\n\n- **Verb Form**: The sentence starts with the verb **أريد (urīdu)**, which is in the first-person singular present tense. This is a common structure in Arabic for expressing a wish or desire.\n- **Prepositional Phrase**: The phrase **الحصول على (al-ḥuṣūl ‘alā)** uses the preposition **على (‘alā)** to connect the verb with the object being obtained.\n- **Indefinite Quantity**: The word **بعض (ba‘ḍ)** is used to indicate an indefinite quantity, similar to \"some\" in English.\n- **Conjunction**: The word **أو (aw)** is used as a conjunction to present an alternative, similar to \"or\" in English.\n- **Modal Particle**: The word **ربما (rubbamā)** is a modal particle that expresses uncertainty or possibility, similar to \"maybe\" in English.\n\n## Translation Notes\n\n- **Direct Translation**: The Arabic sentence directly translates to \"I want to get some chocolate or maybe some of the pastry.\"\n- **Idiomatic Differences**: The Arabic sentence uses **الحصول على (al-ḥuṣūl ‘alā)** to express \"to get,\" which is a more formal way of saying \"to obtain\" in English.\n- **Quantity Expression**: The use of **بعض (ba‘ḍ)** and **بعض من (ba‘ḍ min)** to express \"some\" and \"some of\" respectively, is straightforward and similar to English.\n- **Modal Expression**: The use of **ربما (rubbamā)** to express \"maybe\" is direct and adds a sense of possibility, similar to its English counterpart.\n\nThe sentence structure and vocabulary in Arabic closely mirror the English translation, making it accessible for learners to understand and remember.",
    "peterwhich-5718": "## Translation\n\"Which way is it? I think I should turn left now.\"\n\"أي طريق قد كان؟ أظن أن علي أن أتجه يسارًا.\"\n\n## Sentence Breakdown\n\n### Part 1: أي طريق قد كان؟\n- **أي**: \"Which\"\n  - Usage: Used to ask about the identity of something from a set of possibilities.\n- **طريق**: \"Way\" or \"road\"\n  - Usage: Refers to a path or direction.\n- **قد كان**: \"Is it\"\n  - Usage: **قد** is a particle that can indicate possibility or emphasis. **كان** is the past tense of \"to be,\" but in this context, it is used to form a question about the present.\n\n### Part 2: أظن أن علي أن أتجه يسارًا\n- **أظن**: \"I think\"\n  - Usage: Expresses the speaker's opinion or belief.\n- **أن**: \"That\"\n  - Usage: Introduces a subordinate clause.\n- **علي**: \"Should\"\n  - Usage: Indicates obligation or necessity.\n- **أن أتجه**: \"I should turn\"\n  - **أتجه**: \"To turn\" or \"to head towards\"\n    - Usage: Indicates a change in direction.\n- **يسارًا**: \"Left\"\n  - Usage: Refers to the left direction.\n\n## Grammar\n\n### Question Formation\n- The phrase **أي طريق قد كان؟** is a question asking for direction.\n- **قد** is used to add a sense of possibility or uncertainty.\n\n### Subordinate Clause\n- **أظن أن** introduces a subordinate clause expressing the speaker's thought.\n- **علي أن** indicates obligation, similar to \"should\" in English.\n\n### Verb Conjugation\n- **أتجه** is the first-person singular form of the verb \"to turn\" in the present tense.\n- The verb is conjugated to agree with the subject \"I.\"\n\n## Translation Notes\n\n### Differences in Constructs\n- **أي طريق قد كان؟** directly translates to \"Which way is it?\" but the use of **قد** adds a nuance of possibility or uncertainty that is not explicitly present in the English translation.\n- **أظن أن علي أن أتجه يسارًا** translates to \"I think I should turn left now.\" The use of **علي أن** emphasizes the obligation or necessity, which is conveyed by \"should\" in English.\n\n### Idiomatic Expressions\n- The Arabic sentence uses **علي أن** to express obligation, which is a common idiomatic way to say \"should\" in Arabic.\n- The direction **يسارًا** (left) is used similarly in both languages, but the Arabic sentence structure may feel more formal due to the use of subordinate clauses.",
    "momnoapple-0262": "## Translation\n\"No apples or pears? I can use the chocolate to make a chocolate cake.\"\n\"لا تفاح ولا حتى كمثرى؟ يمكنني أن أستخدم الشوكولاتة لصنع كيك بالشوكولاتة.\"\n\n## Sentence Breakdown\n\n- **لا تفاح ولا حتى كمثرى؟**\n  - **لا تفاح**: \"No apples\"\n    - **لا**: \"No\" (negation particle)\n    - **تفاح**: \"Apples\" (plural noun)\n  - **ولا حتى كمثرى**: \"Or pears\"\n    - **ولا**: \"Or no\" (combines \"و\" meaning \"and\" or \"or\" with \"لا\" meaning \"no\")\n    - **حتى**: \"Even\" (particle used for emphasis)\n    - **كمثرى**: \"Pears\" (plural noun)\n\n- **يمكنني أن أستخدم الشوكولاتة لصنع كيك بالشوكولاتة.**\n  - **يمكنني**: \"I can\"\n    - **يمكن**: \"It is possible\" (verb)\n    - **ني**: \"Me\" or \"I\" (object pronoun suffix)\n  - **أن أستخدم**: \"To use\"\n    - **أن**: \"To\" (particle introducing a verb)\n    - **أستخدم**: \"I use\" (verb in the present tense)\n  - **الشوكولاتة**: \"The chocolate\"\n    - **ال**: \"The\" (definite article)\n    - **شوكولاتة**: \"Chocolate\" (noun)\n  - **لصنع**: \"To make\"\n    - **ل**: \"To\" (preposition)\n    - **صنع**: \"Make\" (verb in the infinitive form)\n  - **كيك بالشوكولاتة**: \"A chocolate cake\"\n    - **كيك**: \"Cake\" (noun)\n    - **بالشوكولاتة**: \"With chocolate\" or \"Chocolate\" (prepositional phrase)\n\n## Grammar\n\n- **Negation**: The sentence uses **لا** and **ولا** for negation. **لا** is a negation particle meaning \"no,\" and **ولا** combines \"و\" (and/or) with \"لا\" (no) to mean \"or no.\"\n- **Possibility**: **يمكنني** is a verb phrase meaning \"it is possible for me\" or \"I can.\" It is formed by combining **يمكن** (it is possible) with the object pronoun suffix **ني** (me).\n- **Infinitive Form**: **لصنع** uses the preposition **ل** (to) with the verb **صنع** (make) in the infinitive form to express purpose or intention.\n- **Prepositional Phrase**: **بالشوكولاتة** uses the preposition **ب** (with) and the definite article **ال** (the) to mean \"with the chocolate\" or \"chocolate.\"\n\n## Translation Notes\n\n- The Arabic sentence uses **حتى** for emphasis, which is not directly translated in the English sentence.\n- The Arabic verb **يمكنني** (\"I can\") is more literal to \"it is possible for me,\" but in context, \"I can\" is a more natural English translation.\n- The prepositional phrase **بالشوكولاتة** (\"with the chocolate\") is translated as \"chocolate\" in English to form the compound noun \"chocolate cake.\"\n- The use of **لصنع** (\"to make\") in Arabic is a direct translation of the infinitive form in English, maintaining the same structure.",
    "andyoustil-5405": "## Translation\n\"And you still had enough coins to buy something you liked.\"\n\"كما أنك قد تبقى لك بعض المال لتشتري شيئًا لنفسك.\"\n\n## Sentence Breakdown\n\n- **كما أنك**: This phrase translates to \"And you.\" It is used to add emphasis and continuity to the sentence.\n  - **كما**: \"As\" or \"And\"\n  - **أنك**: \"You\" (in a way that emphasizes the subject)\n\n- **قد تبقى**: This means \"still had.\" The use of **قد** adds a sense of possibility or continuation.\n  - **قد**: A particle that indicates possibility or emphasis.\n  - **تبقى**: \"Remain\" or \"still had\"\n\n- **لك**: This means \"for you.\" It indicates possession.\n  - **لك**: \"For you\"\n\n- **بعض المال**: This translates to \"some money\" or \"enough coins.\"\n  - **بعض**: \"Some\"\n  - **المال**: \"Money\"\n\n- **لتشتري**: This means \"to buy.\" It is the subjunctive form of the verb \"to buy.\"\n  - **لتشتري**: \"To buy\" (subjunctive mood)\n\n- **شيئًا**: This means \"something.\"\n  - **شيئًا**: \"Something\"\n\n- **لنفسك**: This means \"for yourself.\" It indicates the beneficiary of the action.\n  - **لنفسك**: \"For yourself\"\n\n## Grammar\n\n- **قد تبقى**: The use of **قد** with the past tense verb **تبقى** (remain) indicates a past action that still has relevance or continuity. This construct is similar to the English \"had still remained.\"\n\n- **لتشتري**: The subjunctive mood is used after **لك** (for you) to express purpose or intention. In English, this would be \"so that you can buy.\"\n\n- **لنفسك**: This prepositional phrase indicates the beneficiary of the action. It is similar to the English \"for yourself,\" emphasizing personal benefit.\n\n## Translation Notes\n\n- The Arabic sentence uses **كما أنك** to add emphasis and continuity, which is translated as \"And you.\" This construct is more emphatic than a simple \"And.\"\n\n- The phrase **قد تبقى** translates to \"still had.\" The use of **قد** adds a nuance of continuation or possibility, which is not directly translatable but adds depth to the meaning.\n\n- The subjunctive mood **لتشتري** is used to express the purpose of having the money, which is directly translated as \"to buy.\"\n\n- The phrase **لنفسك** emphasizes the personal benefit, similar to the English \"for yourself,\" but it is more idiomatic in Arabic.",
    "momitsokay-fe97": "## Translation\n\"It's okay, Peter. I'm sure you'll do better next time.\"\n\"حسنًا يا محمد، أنا متأكدة أنك ستبلي حسنًا في المرة المقبلة.\"\n\n## Sentence Breakdown\n\n- **حسنًا يا محمد**\n  - **حسنًا**: This word means \"okay\" or \"alright.\" It is used to reassure or acknowledge something.\n  - **يا محمد**: This phrase means \"Peter.\" In Arabic, \"يا\" is used before a name to address someone directly. Note that the name \"Peter\" is translated to \"محمد\" for cultural relevance.\n\n- **أنا متأكدة**\n  - **أنا**: This means \"I.\"\n  - **متأكدة**: This means \"sure\" or \"certain.\" It is the feminine form of the adjective \"متأكد\" (sure).\n\n- **أنك ستبلي حسنًا**\n  - **أنك**: This means \"that you.\" It is a combination of the particle \"أن\" (that) and the pronoun \"ك\" (you).\n  - **ستبلي**: This is the future tense of the verb \"بلى\" which means \"to do well\" or \"to succeed.\"\n  - **حسنًا**: This means \"well\" or \"good.\" It is used here to emphasize doing well.\n\n- **في المرة المقبلة**\n  - **في**: This means \"in.\"\n  - **المرة**: This means \"the time.\"\n  - **المقبلة**: This means \"next\" or \"coming.\" It is the feminine form of the adjective \"مقبل\" (next).\n\n## Grammar\n\n- **Possessive Pronouns**: The phrase \"يا محمد\" uses the vocative particle \"يا\" to address someone directly. This is a common way to call someone by name in Arabic.\n- **Future Tense**: The verb \"ستبلي\" is in the future tense, indicated by the prefix \"سـ\" which is added to the verb \"بلى\" (to do well).\n- **Gender Agreement**: The adjective \"متأكدة\" is in the feminine form to agree with the feminine subject \"أنا\" (I). Similarly, \"المقبلة\" is in the feminine form to agree with the feminine noun \"المرة\" (the time).\n\n## Translation Notes\n\n- **Cultural Adaptation**: The name \"Peter\" is translated to \"محمد\" to make the sentence more culturally relevant for Arabic speakers.\n- **Idiomatic Expressions**: The phrase \"حسنًا يا محمد\" directly translates to \"okay, Peter\" but carries a reassuring tone similar to the English phrase.\n- **Grammatical Differences**: In Arabic, the future tense is explicitly marked with a prefix, unlike English where context or auxiliary verbs like \"will\" are used.\n- **Gender Specificity**: Arabic adjectives and verbs often change form based on the gender of the subject, which is not always the case in English.",
    "youarenewt-b893": "## Translation\n\"You are new to the village because your family has just moved here.\"\n\n## Sentence Breakdown\n\n- **أنت (anta)**: \"You\" (singular, masculine).\n  - Usage: Used to address a male individual directly.\n\n- **جديد (jadīd)**: \"New\".\n  - Usage: Describes something that is recent or unfamiliar.\n\n- **في (fī)**: \"In\" or \"to\".\n  - Usage: A preposition indicating location or direction.\n\n- **هذه (hādhihi)**: \"This\".\n  - Usage: Demonstrative adjective referring to something close to the speaker.\n\n- **القرية (al-qarya)**: \"The village\".\n  - Usage: Refers to a small rural community.\n\n- **لأن (li'anna)**: \"Because\".\n  - Usage: Conjunction used to explain the reason for something.\n\n- **عائلتك (ʿāʾilatuk)**: \"Your family\".\n  - Usage: Refers to the family of the person being addressed.\n\n- **قد (qad)**: Particle indicating that an action has just occurred.\n  - Usage: often used with past tense verbs to emphasize recent completion.\n\n- **انتقلت (intiqalat)**: \"Moved\".\n  - Usage: Verb in the past tense, third-person feminine singular, meaning to transfer or relocate.\n\n- **لتوها (litwihā)**: \"Just\".\n  - Usage: Adverb indicating that an action has recently happened.\n\n- **هنا (hunā)**: \"Here\".\n  - Usage: Adverb indicating a location near the speaker.\n\n## Grammar\n\n- **Possessive Pronouns**: The word **عائلتك (ʿāʾilatuk)** includes the possessive pronoun **-ك (ka)** which means \"your\". This is attached to the noun **عائلة (ʿāʾila)** to indicate possession.\n\n- **Past Tense Verbs**: The verb **انتقلت (intiqalat)** is in the past tense, third-person feminine singular form. In Arabic, verbs agree with the subject in gender and number.\n\n- **Particle قد (qad)**: This particle is used to indicate that an action has just been completed. It is often used with past tense verbs to emphasize the recent occurrence of the action.\n\n- **Adverbs of Time**: The word **لتوها (litwihā)** means \"just\" and is used to indicate that the action happened very recently.\n\n## Translation Notes\n\n- **Word Order**: Arabic sentence structure often follows a Subject-Verb-Object (SVO) order, similar to English. However, Arabic is more flexible, and the order can change based on emphasis.\n\n- **Possessive Constructs**: In Arabic, possession is often indicated by suffixes attached to nouns, as seen in **عائلتك (ʿāʾilatuk)**.\n\n- **Idiomatic Expressions**: The phrase **لتوها (litwihā)** directly translates to \"just\" and is used similarly in both languages to indicate recent occurrence.\n\n- **Prepositions**: The preposition **في (fī)** is used to indicate location, similar to \"in\" or \"to\" in English.\n\nThis breakdown should help learners understand the sentence structure, grammar, and vocabulary in Arabic, relating it to the English translation for better comprehension.",
    "momgrandma-f748": "## Translation\n\"Grandma is visiting us tonight, so we need five apples to make her favorite apple pie.\"\n\n\"جدتك ستزورنا اليوم، لذا فنحن بحاجة لخمس تفاحات لنصنع لها فطيرة التفاح، فهي المفضلة لديها.\"\n\n## Sentence Breakdown\n\n- **جدتك (jiddatik)**: \"Your grandmother\" or \"Grandma.\"\n  - **جدة (jidda)** means \"grandmother.\"\n  - The possessive suffix **-ك (k)** indicates \"your.\"\n\n- **ستزورنا (satazūrunā)**: \"Will visit us.\"\n  - **ستزور (satazūr)** means \"will visit.\"\n  - The suffix **-نا (nā)** indicates \"us.\"\n\n- **اليوم (al-yawm)**: \"Today.\"\n  - **يوم (yawm)** means \"day.\"\n  - The definite article **الـ (al-)** indicates \"the.\"\n\n- **لذا (li-dhā)**: \"So\" or \"therefore.\"\n  - This is a conjunction used to indicate a result or consequence.\n\n- **فنحن (fa-naḥnu)**: \"So we.\"\n  - **نحن (naḥnu)** means \"we.\"\n  - The prefix **فـ (fa-)** is used for emphasis or to introduce a consequence.\n\n- **بحاجة (bi-ḥājah)**: \"In need.\"\n  - **حاجة (ḥājah)** means \"need.\"\n  - The preposition **بـ (bi-)** indicates a state or condition.\n\n- **لخمس تفاحات (li-khams tuffāḥāt)**: \"For five apples.\"\n  - **خمس (khams)** means \"five.\"\n  - **تفاحات (tuffāḥāt)** is the plural of **تفاحة (tuffāḥa)**, which means \"apple.\"\n\n- **لنصنع (li-naṣnaʿ)**: \"To make.\"\n  - **نصنع (naṣnaʿ)** means \"we make.\"\n  - The prefix **لـ (li-)** indicates purpose or intention.\n\n- **لها (lahā)**: \"For her.\"\n  - The preposition **لـ (li-)** indicates possession or benefit.\n  - The suffix **-ها (hā)** indicates \"her.\"\n\n- **فطيرة التفاح (faṭīrat al-tuffāḥ)**: \"Apple pie.\"\n  - **فطيرة (faṭīra)** means \"pie.\"\n  - **التفاح (al-tuffāḥ)** means \"the apple.\"\n\n- **فهي (fa-hiya)**: \"So it is.\"\n  - **هي (hiya)** means \"she\" or \"it.\"\n  - The prefix **فـ (fa-)** is used for emphasis or to introduce a consequence.\n\n- **المفضلة لديها (al-mufaḍḍalah ladayhā)**: \"Her favorite.\"\n  - **المفضلة (al-mufaḍḍalah)** means \"the favorite.\"\n  - **لديها (ladayhā)** means \"with her\" or \"for her.\"\n\n## Grammar\n\n- **Possessive Suffixes**: Arabic uses suffixes to indicate possession. For example, **-ك (k)** in **جدتك (jiddatik)** means \"your.\"\n- **Verb Conjugation**: The verb **ستزورنا (satazūrunā)** is conjugated in the future tense and includes the object pronoun **-نا (nā)** for \"us.\"\n- **Prepositions**: The preposition **لـ (li-)** is used to indicate purpose or intention, as in **لنصنع (li-naṣnaʿ)** \"to make.\"\n- **Definite Article**: The definite article **الـ (al-)** is used to specify nouns, as in **اليوم (al-yawm)** \"the day.\"\n- **Emphatic Prefix**: The prefix **فـ (fa-)** is used for emphasis or to introduce a consequence, as in **فنحن (fa-naḥnu)** \"so we.\"\n\n## Translation Notes\n\n- **Tense Difference**: In Arabic, the sentence uses the future tense **ستزورنا (satazūrunā)** \"will visit us,\" while the English sentence uses the present continuous \"is visiting us.\"\n- **Possessive Constructs**: Arabic uses suffixes for possession, such as **-ك (k)** for \"your\" in **جدتك (jiddatik)**. English uses separate possessive adjectives like \"your.\"\n- **Emphatic Particles**: Arabic uses the emphatic prefix **فـ (fa-)** to introduce a consequence, which is not directly translatable to English but adds a nuance of emphasis.\n- **Idiomatic Expressions**: The phrase **المفضلة لديها (al-mufaḍḍalah ladayhā)** literally means \"the favorite with her,\" which is idiomatically translated as \"her favorite.\"",
    "momwealson-7f0f": "## Translation\n\"We also need three tomatoes and four eggs for the dinner.\"\n\"كما أننا بحاجة لثلاث حبات من الطماطم وأربع بيضات للعشاء.\"\n\n## Sentence Breakdown\n\n- **كما أننا**: This phrase translates to \"also we\" or \"we also.\" It is used to add an additional point or item to a list or discussion.\n  - **كما**: \"also\"\n  - **أننا**: \"we\"\n\n- **بحاجة ل**: This means \"in need of\" or \"need.\" It indicates a requirement or necessity.\n  - **بحاجة**: \"in need\"\n  - **ل**: \"of\" or \"for\"\n\n- **ثلاث حبات من الطماطم**: This translates to \"three tomatoes.\"\n  - **ثلاث**: \"three\"\n  - **حبات**: \"pieces\" or \"units\" (used here to specify individual tomatoes)\n  - **من**: \"of\"\n  - **الطماطم**: \"tomatoes\"\n\n- **و**: This means \"and.\" It is used to connect items in a list.\n  - **و**: \"and\"\n\n- **أربع بيضات**: This translates to \"four eggs.\"\n  - **أربع**: \"four\"\n  - **بيضات**: \"eggs\"\n\n- **للعشاء**: This means \"for the dinner.\"\n  - **ل**: \"for\"\n  - **العشاء**: \"dinner\"\n\n## Grammar\n\n- **Phrase Structure**: The sentence follows a typical Arabic structure where the subject and verb are clearly stated, followed by the objects needed.\n- **Prepositions**: The preposition **ل** is used multiple times to indicate \"for\" or \"of,\" which is common in Arabic to show possession or need.\n- **Numerals**: Arabic uses a specific structure for numbers followed by nouns. The noun following the number is in the singular form but is understood to be plural based on the number preceding it.\n  - **ثلاث حبات**: \"three pieces\" (understood as three tomatoes)\n  - **أربع بيضات**: \"four eggs\"\n\n## Translation Notes\n\n- **Idiomatic Expressions**: The phrase **كما أننا بحاجة ل** directly translates to \"also we are in need of,\" but in English, it is more naturally expressed as \"we also need.\"\n- **Word Order**: Arabic often places the subject and verb at the beginning of the sentence, followed by the objects. In English, the structure is more flexible, but the typical order is subject-verb-object.\n- **Specificity**: Arabic uses **حبات** to specify individual units of tomatoes, which is not typically done in English. This adds a layer of specificity that is idiomatic in Arabic but not necessary in English.\n- **Prepositions**: The use of **ل** to indicate \"for\" is straightforward and directly translates to English, maintaining the same meaning and function in both languages.",
    "momifyouha-b893": "## Translation\n\"If you have enough coins, you can buy something for yourself.\"\n\n## Sentence Breakdown\n\n- **لو**: This word means \"if\" and is used to introduce conditional sentences.\n- **تبقى**: This is the present tense of the verb \"to remain\" or \"to stay.\" In this context, it means \"if you have.\"\n- **معك**: This means \"with you\" or \"you have.\" It is a prepositional phrase using the preposition **مع** (with) and the suffix **ك** (you).\n- **بعض المال**: This phrase means \"some money.\" **بعض** means \"some\" and **المال** means \"money.\"\n- **يمكنك**: This means \"you can\" or \"it is possible for you.\" It is derived from the verb **يمكن** (to be possible) with the suffix **ك** (you).\n- **أن**: This is a subordinating conjunction that means \"to\" and is used to introduce a subordinate clause.\n- **تشتري**: This is the present tense of the verb \"to buy.\" It means \"you buy.\"\n- **شيئاً**: This means \"something.\" It is the accusative form of the noun **شيء** (thing).\n- **لنفسك**: This means \"for yourself.\" It is a prepositional phrase using the preposition **ل** (for) and the noun **نفسك** (yourself).\n\n## Grammar\n\n- **Conditional Sentence**: The sentence starts with **لو**, which introduces a conditional clause. This is similar to \"if\" in English.\n- **Present Tense Verbs**: Both **تبقى** and **تشتري** are in the present tense. In Arabic, the present tense can also express future actions, especially in conditional sentences.\n- **Prepositional Phrases**: The sentence includes two prepositional phrases: **معك** (with you) and **لنفسك** (for yourself). These phrases help to clarify the relationships between the words in the sentence.\n- **Subordinate Clause**: The phrase **أن تشتري شيئاً لنفسك** is a subordinate clause introduced by **أن**. This structure is common in Arabic for expressing actions that are possible or permitted.\n\n## Translation Notes\n\n- **Conditional Structure**: The Arabic sentence uses **لو** to introduce the conditional clause, which is directly translated as \"if.\"\n- **Verb Tense**: The present tense verbs in Arabic can imply future actions in conditional sentences, similar to how \"you can buy\" implies a future action in English.\n- **Prepositional Phrases**: The use of **معك** and **لنفسك** closely mirrors the English \"with you\" and \"for yourself,\" making the translation straightforward.\n- **Idiomatic Expression**: The phrase **بعض المال** directly translates to \"some money,\" which is idiomatically similar to \"enough coins\" in English, conveying the idea of having sufficient funds.",
    "whenyouarr-5260": "## Translation\n\"When you arrive near the fruits and vegetables, you recognize someone.\"\n\n## Sentence Breakdown\n\n- **عندما (ʿindamā)**: This word means \"when\" and is used to introduce a temporal clause, indicating the time something happens.\n- **وصلت (waṣalta)**: This is the second-person singular past tense form of the verb \"وصل\" (waṣala), which means \"to arrive\" or \"to reach.\" It means \"you arrived.\"\n  - **بالقرب من (bi-l-qurb min)**: This phrase means \"near\" or \"close to.\" It is used to indicate proximity.\n  - **الفواكه (al-fawākih)**: This is the plural form of \"فاكهة\" (fākiha), which means \"fruit.\" So, it means \"fruits.\"\n  - **والخضراوات (wa-l-khuḍrāwāt)**: This is the plural form of \"خضراوات\" (khuḍrāwāt), which means \"vegetables.\" The \"و\" (wa) means \"and,\" so it means \"and vegetables.\"\n  - **قد (qad)**: This particle is used to indicate emphasis or certainty. In this context, it can be translated as \"indeed\" or \"certainly.\"\n  - **تعرفت (taʿarrafta)**: This is the second-person singular past tense form of the verb \"تعرف\" (taʿarrafa), which means \"to recognize\" or \"to know someone.\" It means \"you recognized.\"\n  - **على (ʿalā)**: This preposition means \"on\" or \"upon,\" but in this context, it is used to introduce the object of recognition.\n  - **أحدهم (ʾaḥadahum)**: This means \"someone.\" It is a combination of \"أحد\" (ʾaḥad), which means \"one\" or \"someone,\" and the pronoun \"هم\" (hum), which means \"them.\"\n\n## Grammar\n\n- **Word Order**: Arabic follows a subject-verb-object (SVO) word order, but the sentence often starts with a temporal clause introduced by \"عندما\" (ʿindamā).\n- **Verb Conjugation**: The verbs \"وصلت\" (waṣalta) and \"تعرفت\" (taʿarrafta) are conjugated in the past tense, second-person singular form.\n- **Prepositions**: The preposition \"بالقرب من\" (bi-l-qurb min) is used to indicate proximity, and \"على\" (ʿalā) is used to introduce the object of recognition.\n- **Particle \"قد\" (qad)**: This particle is used to add emphasis or certainty to the action that follows.\n\n## Translation Notes\n\n- **Temporal Clause**: The Arabic sentence starts with \"عندما\" (ʿindamā), which is similar to the English \"when,\" introducing a temporal clause.\n- **Proximity**: The phrase \"بالقرب من\" (bi-l-qurb min) is used to indicate nearness, similar to the English \"near.\"\n- **Emphasis**: The particle \"قد\" (qad) adds a sense of certainty or emphasis, which is not explicitly present in the English translation but implies a confident recognition.\n- **Recognition**: The verb \"تعرفت\" (taʿarrafta) followed by \"على\" (ʿalā) and \"أحدهم\" (ʾaḥadahum) translates to \"you recognized someone,\" with \"على\" (ʿalā) introducing the object of recognition.",
    "youwanttop-0c60": "## Translation\n\"You want to play more, but your mom really insists.\"\n\"أنت تريد أن تلعب لوقت أطول، لكن أمك مصرة بحق.\"\n\n## Sentence Breakdown\n\n- **أنت تريد أن تلعب**:\n  - **أنت**: You (singular, informal).\n  - **تريد**: Want. This verb is in the present tense, second person singular.\n  - **أن تلعب**: To play. The particle **أن** introduces a subordinate clause, and **تلعب** is the subjunctive form of the verb \"to play,\" matching the subject **أنت**.\n\n- **لوقت أطول**:\n  - **لوقت**: For a time. The preposition **ل** (li) indicates \"for,\" and **وقت** (waqt) means \"time.\"\n  - **أطول**: Longer. This is the comparative form of the adjective **طويل** (tawil), meaning \"long.\"\n\n- **لكن**:\n  - But. This conjunction is used to introduce a contrasting idea.\n\n- **أمك**:\n  - Your mom. The possessive pronoun **ك** (ka) is suffixed to **أم** (umm), meaning \"mother.\"\n\n- **مصرة بحق**:\n  - **مصرة**: Insists. This is the feminine singular form of the active participle of the verb **أصر** (asarra), meaning \"to insist.\"\n  - **بحق**: Really. This phrase literally means \"with right\" but is used idiomatically to mean \"really\" or \"truly.\"\n\n## Grammar\n\n- **Verb Conjugation**: The verb **تريد** (turid) is conjugated in the present tense, second person singular, agreeing with the subject **أنت** (anta).\n- **Subordinate Clause**: The particle **أن** (an) introduces the subordinate clause **أن تلعب** (an tal'ab), where **تلعب** (tal'ab) is in the subjunctive mood.\n- **Comparative Adjective**: The adjective **أطول** (aṭwal) is in the comparative form, derived from the base adjective **طويل** (tawil), meaning \"long.\"\n- **Possessive Pronoun**: The possessive pronoun **ك** (ka) is suffixed to **أم** (umm) to indicate \"your mom.\"\n- **Idiomatic Expression**: The phrase **بحق** (biḥaqq) is used idiomatically to mean \"really\" or \"truly,\" adding emphasis to the insistence.\n\n## Translation Notes\n\n- **Literal vs. Idiomatic**: The phrase **بحق** (biḥaqq) literally means \"with right\" but is used idiomatically to mean \"really\" or \"truly.\" This adds a layer of emphasis that might not be immediately apparent in a literal translation.\n- **Subordinate Clause**: The use of **أن** (an) to introduce the subordinate clause **أن تلعب** (an tal'ab) is a common structure in Arabic that corresponds to the English \"to play.\"\n- **Comparative Form**: The comparative adjective **أطول** (aṭwal) is used to indicate \"longer,\" which is a direct translation of the English comparative form \"more.\"\n- **Possessive Construction**: The possessive pronoun **ك** (ka) suffixed to **أم** (umm) is a straightforward way to indicate possession, similar to the English \"your mom.\""
}